In [1]:
from IPython.display import Image

----------------
## PANDAS - String handling
------------

In [2]:
import numpy as np
import pandas as pd

In [3]:
data = ['peter', 'Paul', 'MARY', 'gUIDO']

[s.capitalize() for s in data]

['Peter', 'Paul', 'Mary', 'Guido']

In [4]:
data = ['peter', 'Paul', None, 'MARY', 'gUIDO']

[s.capitalize() for s in data]

AttributeError: 'NoneType' object has no attribute 'capitalize'

let us create a series object ...

In [5]:
names = pd.Series(data)
names

0    peter
1     Paul
2     None
3     MARY
4    gUIDO
dtype: object

In [6]:
names.str.capitalize()

0    Peter
1     Paul
2     None
3     Mary
4    Guido
dtype: object

##### Pandas String Methods

Nearly all `Python's built-in string methods` are `mirrored` by a `Pandas` vectorized string method. Here is a list of Pandas str methods that mirror Python string methods:

|Function name | Function name | Function name | Function name |
|------------- | ------------- | ------------- | ------------- |
|len()         |	lower()|	translate()|	islower()|
|ljust()       |	upper()|	startswith()|	isupper()|
|rjust()       |	find()|	endswith()|	isnumeric()|
|center()      |	rfind()|	isalnum()|	isdecimal()|
|zfill()       |	index()|	isalpha()|	split()|
|strip()       |	rindex()|	isdigit()|	rsplit()|
|rstrip()      |	capitalize()|	isspace()|	partition()|
|lstrip()      |	swapcase()|	istitle()|	rpartition()|

In [7]:
monte = pd.Series(['Graham Chapman', 'John Cleese', 'Terry Gilliam',
                   'Eric Idle', 'Terry Jones', 'Michael Palin'])

In [8]:
monte.str.lower()

0    graham chapman
1       john cleese
2     terry gilliam
3         eric idle
4       terry jones
5     michael palin
dtype: object

In [9]:
monte.str.len()

0    14
1    11
2    13
3     9
4    11
5    13
dtype: int64

In [10]:
monte.str.startswith('T')

0    False
1    False
2     True
3    False
4     True
5    False
dtype: bool

In [11]:
monte.str.split()

0    [Graham, Chapman]
1       [John, Cleese]
2     [Terry, Gilliam]
3         [Eric, Idle]
4       [Terry, Jones]
5     [Michael, Palin]
dtype: object

##### Methods using regular expressions

there are several methods that accept regular expressions to examine the content of each string element, and follow some of the API conventions of Python's built-in `re` module:

|Method|	Description|
|------|---------------|
|match()|	Call re.match() on each element, returning a boolean.|
|extract()|	Call re.match() on each element, returning matched groups as strings.|
|findall()|	Call re.findall() on each element|
|replace()|	Replace occurrences of pattern with some other string|
|contains()|	Call re.search() on each element, returning a boolean|
|count()|	Count occurrences of pattern|
|split()|	Equivalent to str.split(), but accepts regexps|
|rsplit()|	Equivalent to str.rsplit(), but accepts regexps|

`Ex` : we can extract the first name from each by asking for a contiguous group of characters at the beginning of each element:

In [18]:
monte.str.extract('([A-Za-z]+)', expand=False)

0     Graham
1       John
2      Terry
3       Eric
4      Terry
5    Michael
dtype: object

`expandbool`, default True

- If `True`,  return a DataFrame with one column per capture group. 
- If `False`, return a Series/Index if there is one capture group or DataFrame if there are multiple capture groups.

`Ex` : finding all names that start and end with a consonant, making use of the start-of-string (^) and end-of-string ($) regular expression characters:

In [26]:
monte.str.findall(r'^[^AEIOU].*[^aeiou]$')

0    [Graham Chapman]
1                  []
2     [Terry Gilliam]
3                  []
4       [Terry Jones]
5     [Michael Palin]
dtype: object

`Ex` : extract patterns if the first letter is followed by a digit

In [20]:
s = pd.Series(['ak1', 'a1', 'bks', 'n1'])
s

0    ak1
1     a1
2    bks
3     n1
dtype: object

In [25]:
s.str.extract(r'([ab]\d)', expand = True)

     0
0  NaN
1   a1
2  NaN
3  NaN

`Ex`

In [33]:
s = pd.Series(["a1a2b5", "b1", "c1"], index=["A", "B", "C"])
s

A    a1a2b5
B        b1
C        c1
dtype: object

In [34]:
s.str.extractall(r"[ab](\d)")

         0
  match
A 0      1
  1      2
  2      5
B 0      1

##### Example

In [12]:
df = pd.read_csv(r'D:\MYLEARN\DATASETS\world-happiness-report-2019.csv')
df.head()

,Country (region),Ladder,SD of Ladder,Positive affect,Negative affect,Social support,Freedom,Corruption,Generosity,Log of GDP\nper capita,Healthy life\nexpectancy
0,Finland,1,4,41.0,10.0,2.0,5.0,4.0,47.0,22.0,27.0
1,Denmark,2,13,24.0,26.0,4.0,6.0,3.0,22.0,14.0,23.0
2,Norway,3,8,16.0,29.0,3.0,3.0,8.0,11.0,7.0,12.0
3,Iceland,4,9,3.0,3.0,1.0,7.0,45.0,3.0,15.0,13.0
4,Netherlands,5,1,12.0,25.0,15.0,19.0,12.0,7.0,12.0,18.0

1. Extract the first 5 characters of each country using ^(start of the String) and {5} (for 5 characters) and create a new column first_five_letter

In [48]:
df['Country (region)'].str.extract(r"(^\w{1,5})")

         0
0    Finla
1    Denma
2    Norwa
3    Icela
4    Nethe
..     ...
151  Rwand
152  Tanza
153  Afgha
154  Centr
155  South

[156 rows x 1 columns]

##### Count
- First we are counting the countries starting with character 'F'. 

- It returns two elements but not france because the character 'f' here is in lower case. you can add both Upper and Lower case by using [Ff]

In [17]:
S=pd.Series(['Finland','Colombia','Florida','Japan','Puerto Rico','Russia','france', 'F'])

In [19]:
S.str.count(r'(^F.+)')

0    1
1    0
2    1
3    0
4    0
5    0
6    0
7    0
dtype: int64

We can use sum() function to find the total nbr of elements matching the pattern.

In [56]:
S.str.count(r'(^F.*)').sum()

2

In [57]:
S[S.str.count(r'(^F.*)')==1]

0    Finland
2    Florida
dtype: object

In our Original dataframe we are finding all the Country that starts with Character ‘P’ and ‘p’ (both lower and upper case). Basically we are filtering all the rows which return count > 0.

In [59]:
df[df['Country (region)'].str.count('^[pP].*')>0]

,Country (region),Ladder,SD of Ladder,Positive affect,Negative affect,Social support,Freedom,Corruption,Generosity,Log of GDP\nper capita,Healthy life\nexpectancy
30,Panama,31,121,7.0,48.0,41.0,32.0,104.0,88.0,51.0,33.0
39,Poland,40,28,76.0,33.0,44.0,52.0,108.0,77.0,41.0,36.0
62,Paraguay,63,90,1.0,39.0,30.0,34.0,76.0,67.0,90.0,81.0
64,Peru,65,114,36.0,127.0,77.0,61.0,132.0,126.0,76.0,47.0
65,Portugal,66,73,97.0,100.0,47.0,37.0,135.0,122.0,39.0,22.0
66,Pakistan,67,53,130.0,111.0,130.0,114.0,55.0,58.0,110.0,114.0
68,Philippines,69,119,42.0,116.0,75.0,15.0,49.0,115.0,97.0,99.0
109,Palestinian Territories,110,110,128.0,140.0,82.0,134.0,90.0,147.0,112.0,NaN

##### Pandas Match

`match()` function is equivalent to python’s re.match() and returns a boolean value. 

We are finding all the countries in pandas series starting with character ‘P’ (Upper case) .

In [61]:
# Get countries starting with letter P
S=pd.Series(['Finland','Colombia','Florida','Japan','Puerto Rico','Russia','france', 'Poland'])
S[S.str.match(r'(^P.*)')==True]

4    Puerto Rico
7         Poland
dtype: object

Running the same match() method and filtering by Boolean value True we get all the Countries starting with ‘P’ in the original dataframe

In [62]:
df[df['Country (region)'].str.match('^P.*')== True]

,Country (region),Ladder,SD of Ladder,Positive affect,Negative affect,Social support,Freedom,Corruption,Generosity,Log of GDP\nper capita,Healthy life\nexpectancy
30,Panama,31,121,7.0,48.0,41.0,32.0,104.0,88.0,51.0,33.0
39,Poland,40,28,76.0,33.0,44.0,52.0,108.0,77.0,41.0,36.0
62,Paraguay,63,90,1.0,39.0,30.0,34.0,76.0,67.0,90.0,81.0
64,Peru,65,114,36.0,127.0,77.0,61.0,132.0,126.0,76.0,47.0
65,Portugal,66,73,97.0,100.0,47.0,37.0,135.0,122.0,39.0,22.0
66,Pakistan,67,53,130.0,111.0,130.0,114.0,55.0,58.0,110.0,114.0
68,Philippines,69,119,42.0,116.0,75.0,15.0,49.0,115.0,97.0,99.0
109,Palestinian Territories,110,110,128.0,140.0,82.0,134.0,90.0,147.0,112.0,NaN

##### Pandas Replace

- Replaces all the occurence of matched pattern in the string. 

- We want to remove the dash(-) followed by number in the below pandas series object. 

- The regex checks for a dash(-) followed by a numeric digit (represented by d) and replace that with an empty string and the `inplace` parameter set as `True` will update the existing series. 

- The output is list of countres without the dash and number.

In [68]:
# Remove the dash(-) followed by number from all countries in the Series
S=pd.Series(['Finland-1','Colombia-2','Florida-3','Japan-4','Puerto Rico-5','Russia-6','france-7'])

In [75]:
S.str.replace('(-\d)', '', regex=True, case = False)

0        Finland
1       Colombia
2        Florida
3          Japan
4    Puerto Rico
5         Russia
6         france
dtype: object

##### Pandas Findall
- It calls `re.findall()` and find all occurence of matching patterns. 

- We are creating a new list of countries which starts with character 'F' and 'f' from the `Series`.

- The list comprehension checks for all the returned value > 0 and creates a list matching the patterns.

In [76]:
S=pd.Series(['Finland','Colombia','Florida','Japan','Puerto Rico','Russia','france'])

In [77]:
S.str.findall('^[Ff].*')

0    [Finland]
1           []
2    [Florida]
3           []
4           []
5           []
6     [france]
dtype: object

In [78]:
[itm[0] for itm in S.str.findall('^[Ff].*') if len(itm)>0]

['Finland', 'Florida', 'france']

##### Pandas Contains
It uses `re.search()` and returns a boolean value. 

In the below `regex` we are looking for all the countries starting with character ‘F’ (using start with metacharacter ^) in the pandas series object. 

The result shows True for all countries start with character ‘F’ and False which doesn’t.

In [79]:
S=pd.Series(['Finland','Colombia','Florida','Japan','Puerto Rico','Russia','france'])
S.str.contains('^F.*')

0     True
1    False
2     True
3    False
4    False
5    False
6    False
dtype: bool

In our original dataframe we will filter all the countries starting with character ‘I’ . We just need to filter all the True values that is returned by contains() function.

In [80]:
df[df['Country (region)'].str.contains('^I.*')==True]

,Country (region),Ladder,SD of Ladder,Positive affect,Negative affect,Social support,Freedom,Corruption,Generosity,Log of GDP\nper capita,Healthy life\nexpectancy
3,Iceland,4,9,3.0,3.0,1.0,7.0,45.0,3.0,15.0,13.0
12,Israel,13,14,104.0,69.0,38.0,93.0,74.0,24.0,31.0,11.0
15,Ireland,16,34,33.0,32.0,6.0,33.0,10.0,9.0,6.0,20.0
35,Italy,36,31,99.0,123.0,23.0,132.0,128.0,48.0,29.0,7.0
91,Indonesia,92,108,9.0,104.0,94.0,48.0,129.0,2.0,83.0,98.0
98,Ivory Coast,99,134,88.0,130.0,137.0,100.0,62.0,114.0,118.0,147.0
116,Iran,117,109,109.0,150.0,134.0,117.0,44.0,28.0,54.0,77.0
125,Iraq,126,147,151.0,154.0,124.0,130.0,66.0,73.0,64.0,107.0
139,India,140,41,93.0,115.0,142.0,41.0,73.0,65.0,103.0,105.0

##### Pandas Split
- This is equivalent to str.split() and accepts regex, if no regex passed then the default is \s (for whitespace). Here we are splitting the text on white space and expands set as True splits that into 3 different columns

- You can also specify the param `n` to Limit number of splits in output

In [82]:
s = pd.Series(["StatueofLiberty built-on 28-Oct-1886"])
s.str.split(r"\s", n=-1,expand=True)

                 0         1            2
0  StatueofLiberty  built-on  28-Oct-1886

#### Example : Breaking Up A String Into Columns Using Regex

In [83]:
# Create a dataframe with a single column of strings
data = {'raw': ['Arizona 1 2014-12-23       3242.0',
                'Iowa 1 2010-02-23       3453.7',
                'Oregon 0 2014-06-20       2123.0',
                'Maryland 0 2014-03-14       1123.6',
                'Florida 1 2013-01-15       2134.0',
                'Georgia 0 2012-07-14       2345.6']}
df = pd.DataFrame(data, columns = ['raw'])
df

                                  raw
0   Arizona 1 2014-12-23       3242.0
1      Iowa 1 2010-02-23       3453.7
2    Oregon 0 2014-06-20       2123.0
3  Maryland 0 2014-03-14       1123.6
4   Florida 1 2013-01-15       2134.0
5   Georgia 0 2012-07-14       2345.6

##### Search a column of strings for a pattern

In [87]:
# Which rows of df['raw'] contain 'xxxx-xx-xx'?
df['raw'].str.contains('....-..-..', regex=True)

0    True
1    True
2    True
3    True
4    True
5    True
Name: raw, dtype: bool

##### Extract the column of single digits

In [88]:
# In the column 'raw', extract single digit in the strings
df['female'] = df['raw'].str.extract('(\d)', expand=True)
df['female']

0    1
1    1
2    0
3    0
4    1
5    0
Name: female, dtype: object

In [89]:
df

                                  raw female
0   Arizona 1 2014-12-23       3242.0      1
1      Iowa 1 2010-02-23       3453.7      1
2    Oregon 0 2014-06-20       2123.0      0
3  Maryland 0 2014-03-14       1123.6      0
4   Florida 1 2013-01-15       2134.0      1
5   Georgia 0 2012-07-14       2345.6      0

##### Extract the column of dates

In [90]:
# In the column 'raw', extract xxxx-xx-xx in the strings
df['date'] = df['raw'].str.extract('(....-..-..)', expand=True)
df['date']

0    2014-12-23
1    2010-02-23
2    2014-06-20
3    2014-03-14
4    2013-01-15
5    2012-07-14
Name: date, dtype: object

In [91]:
df

                                  raw female        date
0   Arizona 1 2014-12-23       3242.0      1  2014-12-23
1      Iowa 1 2010-02-23       3453.7      1  2010-02-23
2    Oregon 0 2014-06-20       2123.0      0  2014-06-20
3  Maryland 0 2014-03-14       1123.6      0  2014-03-14
4   Florida 1 2013-01-15       2134.0      1  2013-01-15
5   Georgia 0 2012-07-14       2345.6      0  2012-07-14

##### Extract the column of thousands

In [92]:
# In the column 'raw', extract ####.## in the strings
df['score'] = df['raw'].str.extract('(\d\d\d\d\.\d)', expand=True)
df['score']

0    3242.0
1    3453.7
2    2123.0
3    1123.6
4    2134.0
5    2345.6
Name: score, dtype: object

In [93]:
df

                                  raw female        date   score
0   Arizona 1 2014-12-23       3242.0      1  2014-12-23  3242.0
1      Iowa 1 2010-02-23       3453.7      1  2010-02-23  3453.7
2    Oregon 0 2014-06-20       2123.0      0  2014-06-20  2123.0
3  Maryland 0 2014-03-14       1123.6      0  2014-03-14  1123.6
4   Florida 1 2013-01-15       2134.0      1  2013-01-15  2134.0
5   Georgia 0 2012-07-14       2345.6      0  2012-07-14  2345.6

##### Extract the column of words

In [94]:
# In the column 'raw', extract the word in the strings
df['state'] = df['raw'].str.extract('([A-Z]\w{0,})', expand=True)
df['state']

0     Arizona
1        Iowa
2      Oregon
3    Maryland
4     Florida
5     Georgia
Name: state, dtype: object

In [95]:
df

                                  raw female        date   score     state
0   Arizona 1 2014-12-23       3242.0      1  2014-12-23  3242.0   Arizona
1      Iowa 1 2010-02-23       3453.7      1  2010-02-23  3453.7      Iowa
2    Oregon 0 2014-06-20       2123.0      0  2014-06-20  2123.0    Oregon
3  Maryland 0 2014-03-14       1123.6      0  2014-03-14  1123.6  Maryland
4   Florida 1 2013-01-15       2134.0      1  2013-01-15  2134.0   Florida
5   Georgia 0 2012-07-14       2345.6      0  2012-07-14  2345.6   Georgia